{
    "intents": [
        {
            "displayName": "SayF",
            "trainingPhrases": [
                "What is SayF?",
                "SayF",
                "What is SayF app?"
            ],
            "messageTexts": [
                "SayF is an app that helps you save & invest better on every spend."
            ]
        },
        {
            "displayName": "SayF account creation",
            "trainingPhrases": [
                "How to create a SayF account?",
                "What are the steps to create a SayF account?",
                "What do I need to create a SayF account?",
                "Can you guide me on how to create a SayF account?"
            ],
            "messageTexts": [
                "To create a SayF account, simply download the SayF app on your Android mobile device, enter your phone number, and set up UPI auto-save using your PhonePe or Paytm account. You can start investing in digital gold with SayF in less than 30 seconds. Your savings will always be yours and you can withdraw them anytime."
            ]
        },
        {
            "displayName": "SayF bank account",
            "trainingPhrases": [
                "Do I need a bank account to start?",
                "What kind of account do I need to use SayF?",
                "Can I use SayF without a bank account?",
                "Is a bank account necessary for SayF?"
            ],
            "messageTexts": [
                "Yes, you need to have a bank or any UPI account so that you can transfer your savings to your bank. Your savings are safe in your SayF account until you transfer them to your bank account."
            ]
        },
        {
            "displayName": "SayF security",
            "trainingPhrases": [
                "Is SayF secure?",
                "How secure is SayF?",
                "Can I trust SayF with my savings?",
                "Is my money safe with SayF?"
            ],
            "messageTexts": [
                "The SayF app is completely safe and secure to use for your daily gold savings, investments, and partner store purchases. All transactions are 100% safe and secured in Sequel Vaults monitored by SEBI registered IDBI trusteeship. As a result, investing via the SayF app is safer. Your savings will always be yours, and you have complete control over your money; just click a button to halt, restart, or withdraw Gold."
            ]
        },
        {
            "displayName": "SayF fees",
            "trainingPhrases": [
                "Is there any fee for using SayF?",
                "Do I need to pay any charges for using SayF?",
                "Does SayF charge any interest or fees?"
            ],
            "messageTexts": [
                "There is absolutely no interest and zero fees when using SayF."
            ]
        },
        {
            "displayName": "SayF KYC",
            "trainingPhrases": [
                "What is KYC?",
                "What is KYC process?",
                "What is KYC process in SayF?",
                "What is KYC process in SayF app?",
                "Is KYC required to start saving?"
            ],
            "messageTexts": [
                "KYC verification is not required to start saving with SayF. A one-step new user sign in lets you start investing in digital gold with SayF in less than 30 seconds."
            ]
        },
        {
            "displayName": "Set up Autopay/Daily Savings",
            "trainingPhrases": [
                "How can I set up Autopay on SayF?",
                "How can I set up daily savings on SayF?",
                "What is the process for setting up Autopay?",
                "How can I change my daily savings amount?",
                "How much can I deposit for daily savings on SayF?"
            ],
            "messageTexts": [
                "Set up Daily Savings by clicking the 'Daily Savings' icon on the app's home screen and entering the amount you want to invest each day. You may deposit anywhere around  Rs. 10 to Rs. 500, which will be deducted from your bank account and invested on a daily basis. \nIf you want to change the amount of your daily savings at any time, go to the 'Daily Savings' option on your dashboard. When this button appears, type in the new amount you want to use.\nSet up Auto-Pay: Setting up Auto-Pay on SayF is a simple and straightforward procedure. Set up your SayF Autopay in less than 45 seconds by following these instructions.\n1. On your home screen, click activate your Auto-save option.\n2. Understand how UPI autosave helps you save through a video.\n3. Select the UPI app.\n4. Buy the gold for Rs.1 using your UPI PIN. Your SayF Autosave is set up after the payment is successful & you get the Rs.1 gold invested in your SayF portfolio."
            ]
        },
        {
            "displayName": "UPI AutoSave",
            "trainingPhrases": [
                "What is UPI AutoSave?",
                "How does UPI AutoSave work?",
                "How can I set up UPI AutoSave?",
                "How can I set up UPI AutoSave on SayF?",
                "How can I set up UPI AutoSave on SayF app?",
                "What is a UPI autosave, and how does it work?"
            ],
            "messageTexts": [
                "The UPI autosave function enables SayF to provide your bank a standing order to debit a predefined amount from your account on a regular basis. SayF allows you to set up auto-save up to Rs. 500."
            ]
        }
    ]
}